In [1]:
import pandas as pd
import numpy as np
import scipy
from scipy import stats

     A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.


     Minitab File : Cutlets.mtw

In [2]:
data=pd.read_csv("cutlets.csv")

In [3]:
data.sample(20)

    Unit A  Unit B
22  6.5341  6.5217
28  6.9431  6.3346
31  7.2783  7.1180
10  7.3930  6.8810
19  7.3495  6.7478
8   6.6840  7.2402
7   7.0621  6.6606
20  6.9438  6.8889
18  7.2828  7.3070
29  7.0852  7.5459
33  7.3943  6.5780
0   6.8090  6.7703
17  7.2705  7.4314
30  6.7794  7.0992
4   7.4488  7.1522
1   6.4376  7.5093
13  6.9256  6.0380
5   7.3871  6.8110
16  6.5970  6.6672
21  7.1560  7.4220

In [4]:
data.mean()

Unit A    7.019091
Unit B    6.964297
dtype: float64

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Unit A  35 non-null     float64
 1   Unit B  35 non-null     float64
dtypes: float64(2)
memory usage: 688.0 bytes

In [6]:
data1=data.sample(20)

In [7]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 14 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Unit A  20 non-null     float64
 1   Unit B  20 non-null     float64
dtypes: float64(2)
memory usage: 480.0 bytes

In [8]:
data1.mean()

Unit A    7.075560
Unit B    7.005615
dtype: float64

In [9]:
data1.std()

Unit A    0.337317
Unit B    0.330035
dtype: float64

# 2 sample and 1 tail

In [10]:
p=stats.ttest_ind(data1['Unit A'],data1['Unit B'])[1]

In [11]:
p

0.5114365100426665

In [12]:
p/2

0.2557182550213333

# Anova test

A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.
   
  Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.
 
 
    Minitab File: LabTAT.mtw

In [13]:
df=pd.read_csv("LabTAT.csv")

In [14]:
df1=df.sample(40)

In [15]:
df1

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
79         190.02        199.62        211.19        167.26
55         182.62        183.62        192.81        146.46
22         178.24        199.43        205.31        166.21
84         210.38        161.45        238.70        157.48
20         192.03        161.09        214.71        150.22
43         166.33        197.68        225.42        161.96
45         189.84        168.03        228.21        180.14
65         161.99        202.78        173.08        145.07
2          192.77        194.92        201.23        185.18
54         188.01        179.43        192.75        161.94
82         190.88        158.08        197.33        168.92
87         176.16        194.10        208.04        173.37
97         162.43        185.63        201.99        167.55
42         166.86        202.29        196.64        157.58
35         181.69        179.32        200.58        174.79
76         164.88        167.90        184.70        153.74
78         168.39        170.73        180.94        159.97
66         138.30        176.63        193.08        128.93
28         190.36        167.55        191.64        179.08
114        145.89        175.16        203.39        139.34
98         178.81        197.38        195.60        132.49
91         161.05        180.53        184.28        162.67
26         180.67        182.37        215.78        143.26
38         184.42        187.57        181.87        176.67
94         168.62        159.92        204.28        172.38
100        164.65        194.81        211.23        176.79
60         181.45        178.42        172.92        176.21
119        182.09        215.17        221.49        162.21
9          165.88        198.68        208.43        161.98
118        182.40        197.18        194.52        150.87
47         188.63        187.52        170.58        166.68
33         187.18        153.75        206.49        142.43
115        178.49        170.66        193.80        172.68
68         201.27        148.70        215.17        181.76
14         180.19        182.67        159.69        163.81
25         176.13        180.45        231.76        132.21
83         178.08        163.74        205.62        168.90
74         186.22        182.17        189.98        167.83
39         183.45        163.69        214.39        158.20
70         172.62        189.65        199.70        162.11

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 40 entries, 79 to 70
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Laboratory 1  40 non-null     float64
 1   Laboratory 2  40 non-null     float64
 2   Laboratory 3  40 non-null     float64
 3   Laboratory 4  40 non-null     float64
dtypes: float64(4)
memory usage: 1.6 KB

In [17]:
df1.mean()

Laboratory 1    178.00925
Laboratory 2    181.01175
Laboratory 3    200.48300
Laboratory 4    161.43325
dtype: float64

In [18]:
df1.std()

Laboratory 1    13.873941
Laboratory 2    15.676133
Laboratory 3    17.080814
Laboratory 4    14.263721
dtype: float64

In [19]:
import scipy.stats as stats
stats.f_oneway(df.iloc[:,0],df.iloc[:,1],df.iloc[:,2],df.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

# chi-square test

      Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions.

In [20]:
d=pd.read_csv("BuyerRatio.csv")

In [21]:
d

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [22]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Observed Values  2 non-null      object
 1   East             2 non-null      int64
 2   West             2 non-null      int64
 3   North            2 non-null      int64
 4   South            2 non-null      int64
dtypes: int64(4), object(1)
memory usage: 208.0+ bytes

In [23]:
d.mean()

East     242.5
West     832.5
North    743.5
South    410.0
dtype: float64

In [24]:
from scipy.stats import chi2_contingency

In [25]:
d0=[[50,42,31,70],[435,1523,1356,750]]
stat,p,dof,expected = chi2_contingency(d0)
alpha = 0.05
print("p value is " + str(p))
if p <= alpha:
    print('dependent(reject H0)')
else:
    print('independent(H0 hold true)')

p value is 6.715327566383993e-21
dependent(reject H0)

     TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain %  of the customer order forms. Any error in order form renders it defective and has to be reworked before processing.  The manager wants to check whether the defective %  varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences

Minitab File: CustomerOrderForm.mtw

In [26]:
data2=pd.read_csv("Costomer+OrderForm.csv")

In [27]:
data2.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [28]:
Philippines_value=data2['Phillippines'].value_counts()
Indonesia_value=data2['Indonesia'].value_counts()
Malta_value=data2['Malta'].value_counts()
India_value=data2['India'].value_counts()
print(Philippines_value)
print(Indonesia_value)
print(Malta_value)
print(India_value)

Error Free    271
Defective      29
Name: Phillippines, dtype: int64
Error Free    267
Defective      33
Name: Indonesia, dtype: int64
Error Free    269
Defective      31
Name: Malta, dtype: int64
Error Free    280
Defective      20
Name: India, dtype: int64

In [29]:
data2.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [30]:
from scipy.stats import chi2_contingency

In [31]:
data3=[[271,267,269,280],[29,33,31,20]]
stat,p,dof,expected=chi2_contingency(data3)
alpha = 0.05
print("p value is"+str(p))
if p<= alpha:
    print("dependent(reject H0)")
else:
    print("independent(H0 hold true)")

p value is0.2771020991233135
independent(H0 hold true)